@lhercot 
Unfortunately it not resolved and it seems to be introducing another problem.

When I run a plan/apply.  The first attempt says it is successful
```
tyscott@TYSCOTT-DESKTOP:~/terraform-cisco-modules/ndo-test$ tfa
module.tenants["terraform"].mso_schema_template_bd.bridge_domains["10.88.203.0"]: Modifying... [id=10.88.203.0]
module.tenants["terraform"].mso_schema_template_bd.bridge_domains["10.88.203.0"]: Modifications complete after 1s [id=10.88.203.0]
module.tenants["terraform"].mso_schema_template_bd_subnet.bridge_domain_subnets["10.88.203.0:10.88.203.1/24"]: Creating...
module.tenants["terraform"].mso_schema_template_bd_subnet.bridge_domain_subnets["10.88.203.0:10.88.203.1/24"]: Creation complete after 0s [id=10.88.203.1]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

```

But when I go to NDO the value in the dhcp relay policies is blank

Running a plan again it says it is going to delete and re-add
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.tenants["terraform"].mso_schema_template_bd.bridge_domains["10.88.203.0"] will be updated in-place
  ~ resource "mso_schema_template_bd" "bridge_domains" {
        id                              = "10.88.203.0"
        name                            = "10.88.203.0"
        # (18 unchanged attributes hidden)

      - dhcp_policies {
          - dhcp_option_policy_version = 0 -> null
          - name                       = "dummy" -> null
          - version                    = 0 -> null
        }
      + dhcp_policies {
          + dhcp_option_policy_name    = (known after apply)
          + dhcp_option_policy_version = (known after apply)
          + name                       = "dummy"
          + version                    = 3
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.plan"
```

and then deleted the subnet associated to the bridge domain and the next plan starts the re-create of the relay and subnet associations

```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tenants["terraform"].mso_schema_template_bd.bridge_domains["10.88.203.0"] will be updated in-place
  ~ resource "mso_schema_template_bd" "bridge_domains" {
        id                              = "10.88.203.0"
        name                            = "10.88.203.0"
        # (18 unchanged attributes hidden)

      - dhcp_policies {
          - dhcp_option_policy_version = 0 -> null
          - name                       = "dummy" -> null
          - version                    = 0 -> null
        }
      + dhcp_policies {
          + dhcp_option_policy_name    = (known after apply)
          + dhcp_option_policy_version = (known after apply)
          + name                       = "dummy"
          + version                    = 3
        }
    }

  # module.tenants["terraform"].mso_schema_template_bd_subnet.bridge_domain_subnets["10.88.203.0:10.88.203.1/24"] will be created
  + resource "mso_schema_template_bd_subnet" "bridge_domain_subnets" {
      + bd_name            = "10.88.203.0"
      + description        = (known after apply)
      + id                 = (known after apply)
      + ip                 = "10.88.203.1/24"
      + no_default_gateway = false
      + querier            = false
      + schema_id          = "64703625321af62f63df94b5"
      + scope              = "public"
      + shared             = false
      + template_name      = "terraform"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.plan"
tyscott@TYSCOTT-DESKTOP:~/terraform-cisco-modules/ndo-test$ 
```

